Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: For background functions, you launch the invoker with a target class of `io.quarkus.gcp.functions.BackgroundFunction`.
ja_jp: BackgroundFunction関数の場合は、 `io.quarkus.gcp.functions.BackgroundFunction` のターゲットクラスでinvokerを起動します。

source: For backward compatibility reasons, ID token decryption is attempted if `quarkus.oidc.token.decryption-key-location` is configured, but using an optional `quarkus.oidc.token.decrypt-id-token` boolean property is RECOMMENDED instead, to allow for more flexibility in selecting decryption keys.
ja_jp: 後方互換性の理由により、 `quarkus.oidc.token.decryption-key-location` が設定されている場合は ID トークンの復号化が試行されますが、復号キー選択の柔軟性を高めるために、代わりにオプションの `quarkus.oidc.token.decrypt-id-token` ブール値プロパティーを使用することが推奨されます。

source: For backward compatibility reasons, it is necessary to explicitly indicate that the optional dependencies need to be filtered.
ja_jp: 後方互換性の理由から、オプションの依存関係をフィルタリングする必要があることを明示的に示す必要があります。

source: For backwards compatibility reasons channel metrics are not enabled by default and can be enabled with:
ja_jp: 下位互換性のため、チャネルメトリクスはデフォルトでは有効化されていませんが、次の方法で有効化できます。

source: For backwards compatibility reasons, channel metrics are not enabled by default and can be enabled with: `smallrye.messaging.observation.enabled=true`.
ja_jp: 下位互換性のため、チャネルメトリクスはデフォルトでは有効化されていませんが、`smallrye.messaging.observation.enabled=true` で有効化することができます。

source: For blocking operations, invoking startup code is pretty trivial:
ja_jp: ブロッキング操作の場合、起動コードの呼び出しは非常に簡単です。

source: For built-in dialects, the expected value is one of the names in the link:{hibernate-orm-dialect-docs-url}[official list of dialects], *without* the `Dialect` suffix, for example `Cockroach` for `CockroachDialect`.
ja_jp: 組み込みダイアレクトの場合、指定できる値は link:{hibernate-orm-dialect-docs-url}[ダイアレクトの公式リスト] にある名前のいずれかで、 `Dialect` の接尾辞を *除いた* ものです。 たとえば、 `CockroachDialect` の場合は `Cockroach` となります。

source: For cases in which you need to modify the generated `ServiceBinding` to fix a name mismatch, use the `quarkus.kubernetes-service-binding.services` properties and specify the service's name as the service key.
ja_jp: 生成された `ServiceBinding` を修正して名前の不一致を修正する必要がある場合は、`quarkus.kubernetes-service-binding.services` プロパティーを使用して、サービスの名前をサービスキーとして指定します。

source: For cases where this is not desired behavior, the `@io.quarkus.deployment.annotations.Weak` annotation may be used. This annotation indicates that the build step should not automatically be included solely on the basis of producing the annotated value.
ja_jp: これが望ましくない動作である場合は、 `@io.quarkus.deployment.annotations.Weak` アノテーションを使用できます。このアノテーションは、アノテーション付きの値の生成のみに基づいてビルドステップが自動的に含まれるべきではないことを示しています。

source: For cloud events functions, you launch the invoker with a target class of `io.quarkus.funqy.gcp.functions.FunqyCloudEventsFunction``.
ja_jp: cloud events functionsの場合は、 `io.quarkus.funqy.gcp.functions.FunqyBackgroundFunction` をターゲットクラスとして invoker を起動します。

source: For cloud events functions, you launch the invoker with a target class of `io.quarkus.gcp.functions.QuarkusCloudEventsFunction`.
ja_jp: CloudEventsFunctionの場合は、 `io.quarkus.gcp.functions.QuarkusCloudEventsFunction` のターゲットクラスでinvokerを起動します。

source: For complete examples, see the https://github.com/a2aproject/a2a-java/tree/main/examples/helloworld[Hello World example] in the repository.
ja_jp: 完全な例については、リポジトリ内の https://github.com/a2aproject/a2a-java/tree/main/examples/helloworld[Hello World の例] を参照してください。

source: For configuration details on setting up multiple persistence units, refer to the xref:hibernate-orm.adoc#multiple-persistence-units[Multiple Persistence Units] section in the Hibernate ORM guide.
ja_jp: 複数の永続化ユニットの設定の詳細については、Hibernate ORM ガイドの xref:hibernate-orm.adoc#multiple-persistence-units[複数の永続化ユニット] セクションを参照してください。

source: For consistency and context clarity, use the following guidelines for constructing your cross-reference phrases:
ja_jp: 一貫性とコンテキストの明確さを保つために、クロスリファレンスの文章を作成する場合には次のガイドラインに従ってください。

source: For consistency with various Jakarta EE specifications, it is recommended to always repeat annotations instead of relying on annotation inheritance.
ja_jp: さまざまな Jakarta EE 仕様との整合性を保つために、アノテーションの継承に依存するのではなく、常にアノテーションを繰り返すことが推奨されます。

source: For container-based services, it's usually convenient to extend `GenericContainer`. In that case, there's not even any need to implement `start()`. Most Dev Services implementations already provide a subclass of `GenericContainer`, so the diff is just to add `implements Startable` and then add a `close()` method. The `close` method can delegate to the superclass.
ja_jp: コンテナーベースのサービスの場合、通常は `GenericContainer` を継承するのが便利です。その場合、 `start()` を実装する必要さえありません。ほとんどの Dev Services 実装はすでに `GenericContainer` のサブクラスを提供しているため、差分は `implements Startable` を追加し、 `close()` メソッドを追加するだけです。 `close` メソッドはスーパークラスに委譲できます。

source: For convenience there is a project in github with all the steps from the tutorial. You can clone it with the following command:
ja_jp: 便宜上、チュートリアルのすべての手順を含むプロジェクトが github にあります。以下のコマンドでこれをクローンできます。

source: For convenience, https://github.com/quarkusio/opentracing-quickstart-migration[the repository] containing the app to migrate, includes several branches with commits mimicking the migration steps described in this tutorial. You can check out the `main` branch to start from the beginning.
ja_jp: 便宜上、移行するアプリケーションを含む https://github.com/quarkusio/opentracing-quickstart-migration[リポジトリー] には、このチュートリアルで説明した移行手順を模倣したコミットを含むいくつかのブランチが含まれています。 `main` ブランチを確認して、最初から開始できます。

source: For critical operations such as persisting catalog events, Polaris uses Quarkus Fault Tolerance (which relies on SmallRye Fault Tolerance) to ensure reliability. Here is an example of how Polaris implements a resilient flush operation to the metadata store:
ja_jp: カタログイベントの永続化などの重要な操作には、Polaris は信頼性を確保するために Quarkus Fault Tolerance (SmallRye Fault Tolerance に依存) を使用します。以下に、Polaris がメタデータストアへの回復力のあるフラッシュ操作を実装する方法の例を示します。

source: For custom iterations: `BcryptUtil.bcryptHash(password, iterationCount)` where higher iterations (12-14) provide more security but slower performance.
ja_jp: カスタムイテレーションの場合: `BcryptUtil.bcryptHash(password, iterationCount)` を使用します。イテレーション数を高くする (12-14) とセキュリティは向上しますが、パフォーマンスは低下します。

source: For database services, if the label `io.quarkus.devservices.compose.jdbc.parameters` is set, the parameters are added to the JDBC URL.
ja_jp: データベースサービスの場合、 `io.quarkus.devservices.compose.jdbc.parameters` ラベルが設定されていると、そのパラメーターが JDBC URL に追加されます。

source: For databases supporting it (i.e. all of them except Microsoft SQL Server for which it is only possible to override the password), you can override the database name, username and password used by the Dev Service.
ja_jp: これをサポートするデータベース (つまり、パスワードの上書きのみが可能な Microsoft SQL Server を除くすべてのデータベース) では、Dev Service が使用するデータベース名、ユーザー名、パスワードを上書きできます。

source: For debugging purpose, it is possible to log the request generated by the typesafe client and the response sent back by the server by changing the log level of the `io.smallrye.graphql.client` category to `TRACE` (see the xref:logging.adoc#configure-the-log-level-category-and-format[Logging guide] for more details about how to configure logging).
ja_jp: デバッグのために、 `io.smallrye.graphql.client` カテゴリのログレベルを `TRACE` に変更することで、typesafe クライアントによって生成されたリクエストと、サーバーによって送り返されたレスポンスをログに記録することができます(ロギングの設定方法の詳細については、 xref:logging.adoc#configure-the-log-level-category-and-format[ロギングガイド] を参照してください)。

source: For declarative clients using `@RegisterRestClient`, simply providing a CDI bean that implements `ClientLogger` is enough for that logger to be used by said clients.
ja_jp: `@RegisterRestClient` を使用する宣言型クライアントの場合、 `ClientLogger` を実装する CDI Bean を提供するだけで、そのロガーをクライアントが使用できるようになります。

source: For demo purposes, let's create a simple Echo endpoint that will act as the server part.
ja_jp: デモ用に、サーバー部分として機能するシンプルなEchoエンドポイントを作成してみましょう。

source: For demonstration purposes, we create an endpoint that does nothing but log a sentence. You don't need to do this inside your application.
ja_jp: デモのために、文をログに記録するだけのエンドポイントを作成します。これをアプリケーション内で行う必要はありません。

source: For detailed configuration options, see the following Configuration Properties section.
ja_jp: 詳細な設定オプションについては、次の設定プロパティーセクションを参照してください。

source: For detailed explanations about the memory management component in GraalVM, see the link:https://www.graalvm.org/{graalvm-docs-version}/reference-manual/native-image/optimizations-and-performance/MemoryManagement[GraalVM Memory Management] guide.
ja_jp: GraalVM のメモリー管理コンポーネントの詳細な説明については、link:https://www.graalvm.org/{graalvm-docs-version}/reference-manual/native-image/optimizations-and-performance/MemoryManagement[GraalVM メモリー管理] ガイドを参照してください。

source: For detailed steps, see the xref:security-oidc-bearer-token-authentication.adoc[OIDC Bearer Token Authentication] guide.
ja_jp: 詳細な手順については、xref:security-oidc-bearer-token-authentication.adoc[OIDC ベアラートークン認証] ガイドを参照してください。

source: For details about JDBC configuration options and configuring other aspects, such as the connection pool size, refer to the <<jdbc-configuration,JDBC configuration reference>> section.
ja_jp: JDBC 設定オプションや、接続プールサイズなどの他の側面の設定に関するすべての詳細については、<<jdbc-configuration,JDBC 設定リファレンス>> セクションを参照してください。

source: For details about its configuration, see the xref:#quarkus-core_section_quarkus-log-console[console logging configuration] reference.
ja_jp: 設定の詳細は、xref:#quarkus-core_section_quarkus-log-console[コンソールロギング設定] リファレンスを参照してください。

source: For details about its configuration, see the xref:#quarkus-core_section_quarkus-log-file[file logging configuration] reference.
ja_jp: 設定の詳細は、xref:#quarkus-core_section_quarkus-log-file[ファイルログ設定] リファレンスを参照してください。

source: For details about its configuration, see the xref:#quarkus-core_section_quarkus-log-syslog[Syslog logging configuration] reference.
ja_jp: 設定の詳細は、xref:#quarkus-core_section_quarkus-log-syslog[システムロギング設定] リファレンスを参照してください。

source: For details about its configuration, see the xref:#quarkus-log-logging-log-config_quarkus-log-console-console-logging[console logging configuration] reference.
ja_jp: 設定の詳細については、 xref:quarkus-log-logging-log-config_quarkus-log-console-console-logging[コンソールロギングの設定] リファレンスを参照してください。

source: For details about its configuration, see the xref:#quarkus-log-logging-log-config_quarkus-log-file-file-logging[file logging configuration] reference.
ja_jp: 設定の詳細については、 xref:quarkus-log-logging-log-config_quarkus-log-file-file-logging[ファイル・ロギング設定] リファレンスを参照してください。

source: For details about its configuration, see the xref:#quarkus-log-logging-log-config_quarkus-log-syslog-syslog-logging[Syslog logging configuration] reference.
ja_jp: 設定の詳細については、 xref:quarkus-log-logging-log-config_quarkus-log-syslog-syslog-logging[Syslogロギング設定] リファレンスを参照してください。

source: For details of its configuration options, see link:#quarkus-log-logging-log-config_quarkus.log.console-console-logging[the Console Logging configuration reference].
ja_jp: その設定オプションの詳細については、link:#quarkus-log-logging-log-config_quarkus.log.console-console-logging[コンソール ロギング設定リファレンス] を参照してください。

source: For details of its configuration options, see link:#quarkus-log-logging-log-config_quarkus.log.file-file-logging[the File Logging configuration reference].
ja_jp: その設定オプションの詳細については、link:#quarkus-log-logging-log-config_quarkus.log.file-file-logging[ファイル ロギング設定リファレンス] を参照してください。

source: For details of its configuration options, see link:#quarkus-log-logging-log-config_quarkus.log.syslog-syslog-logging[the Syslog Logging configuration reference].
ja_jp: その設定オプションの詳細については、link:#quarkus-log-logging-log-config_quarkus.log.syslog-syslog-logging[Syslog Logging設定リファレンス] を参照してください。

source: For details, see the Quarkus xref:opentelemetry-logging.adoc[OpenTelemetry Logging] guide.
ja_jp: 詳細は、Quarkus xref:opentelemetry-logging.adoc[OpenTelemetry Logging] ガイドを参照してください。

source: For dev mode, an even better option is to set the `application-type` property to `hybrid`:
ja_jp: 開発モードの場合、さらに良い選択肢は、 `application-type` プロパティーを `hybrid` に設定することです。

source: For development and tests, we rely on <<dev-services,Dev Services>>, which means Quarkus will start a PostgreSQL database and Elasticsearch cluster automatically. In production mode, however, we will want to start a PostgreSQL database and Elasticsearch cluster manually, which is why we provide Quarkus with this connection info in the `prod` profile (`%prod.` prefix).
ja_jp: 開発およびテストでは、<<dev-services,Dev Services>> に依存します。これは、Quarkus が PostgreSQL データベースと Elasticsearch クラスタを自動的に開始することを意味します。しかし、本番モードでは、PostgreSQL データベースと Elasticsearch クラスターを手動で起動する必要があります。そのため、この接続情報を `prod` プロファイル (`%prod.` プレフィックス) で Quarkus に提供します。

source: For development and tests, we rely on <<dev-services,Dev Services>>, which means Quarkus will start a PostgreSQL database and Elasticsearch cluster automatically. In production mode, however, you will want to start a PostgreSQL database and Elasticsearch cluster manually, which is why we provide Quarkus with this connection info in the `prod` profile (`%prod.` prefix).
ja_jp: 開発およびテストでは、 <<dev-services,Dev Services>> に依存します。これは、QuarkusがPostgreSQLデータベースとElasticsearchクラスタを自動的に開始することを意味します。 しかし、本番モードでは、PostgreSQLデータベースとElasticsearchクラスターを手動で起動したいと思うでしょう。そのため、この接続情報を `prod` プロファイル（ `%prod.` プレフィックス）でQuarkusに提供します。

source: For development and tests, we rely on <<dev-services,Dev Services>>, which means Quarkus will start an Elasticsearch cluster automatically. In production mode, however, we will want to start an Elasticsearch cluster manually, which is why we provide Quarkus with this connection info in the `prod` profile (`%prod.` prefix).
ja_jp: 開発とテストの場合は、<<dev-services,Dev Services>> に依存します。 つまり、Quarkus は Elasticsearch クラスターを自動的に起動します。 しかし、実稼働モードの場合は、 Elasticsearch クラスターを手動で起動したいと考えています。 そのため、 `prod` プロファイルで Quarkus にこの接続情報を提供します (`%prod.` 接頭辞)。

source: For development and tests, we rely on xref:dev-services[Dev Services], which means Quarkus will start a PostgreSQL database and Elasticsearch cluster automatically. In production mode, however, you will want to start a PostgreSQL database and Elasticsearch cluster manually, which is why we provide Quarkus with this connection info in the `prod` profile (`%prod.` prefix).
ja_jp: 開発およびテストでは、我々は xref:dev-services[Dev Services] に頼っています。つまり、QuarkusはPostgreSQLデータベースとElasticsearchクラスタを自動的に開始します。しかし、本番モードでは、PostgreSQLデータベースとElasticsearchクラスターを手動で起動したいと思うでしょう。そのため、Quarkusに、この接続情報を `prod` プロファイル（ `%prod.` プレフィックス）で提供するのです。

source: For dynamic GraphQL clients, you can override the `quarkus.oidc-client-graphql.client-name` configuration property on a per-client basis with the `quarkus.oidc-client-graphql."graphql-client".client-name` configuration property.
ja_jp: 動的 GraphQL クライアントの場合、 `quarkus.oidc-client-graphql."graphql-client".client-name` 設定プロパティーを使用して、`quarkus.oidc-client-graphql.client-name` 設定プロパティーをクライアントごとにオーバーライドできます。

source: For dynamic and streaming labels, see the <<JsonRPC>> Section.
ja_jp: 動的ラベルとストリーミングラベルについては、<<JsonRPC>> セクションを参照してください。

source: For dynamic and streaming labels, the method name is the name of the JsonRPC method, that we will discuss later.
ja_jp: 動的ラベルとストリーミングラベルの場合、メソッド名は JsonRPC メソッドの名前であり、これについては後で説明します。

source: For dynamic messages, wrap the default string in str:
ja_jp: 動的メッセージの場合、デフォルトの文字列を str: で囲みます。

source: For each Quarkus release, it's the same story: it comes with a ton of exciting new features and enhancements... But believe it or not, it's true.
ja_jp: Quarkusのリリースのたびに、同じことが起きています:沢山の刺激的な新機能や機能強化が行われています、、信じられないかもしれませんが、本当です。

source: For each author, add it to the index.
ja_jp: author ごとに、これをインデックスに追加します。

source: For each bean annotated with `@Startup` a synthetic observer of `StartupEvent` is generated. The default priority is used.
ja_jp: `@Startup` でアノテーションされた各Beanに対して、 `StartupEvent` の合成オブザーバが生成されます。デフォルトの優先度が使用されます。

source: For each call you are intending to do, add a method and use annotations to describe the behavior. You can combine the REST Client with the <a href="https://quarkus.io/guides/smallrye-fault-tolerance">fault tolerance extension</a> to handle failure gracefully. Then, in your resource, just use the <code>ElementService</code> interface:
ja_jp: 意図している各呼び出しに対して、メソッドを追加し、アノテーションを使用して動作を記述します。RESTクライアントと<a href="https://quarkus.io/guides/smallrye-fault-tolerance">fault tolerance エクステンション</a>を組み合わせることで、失敗をグレースフルに処理することができます。そして、リソースでは <code>ElementService</code> インターフェースを使用するだけです。

source: For each channel, you can disable the checks using:
ja_jp: チャネルごとに、以下を使用してチェックを無効にできます。

source: For each chunk, we produce a String
ja_jp: 各チャンクは、String を生成します。

source: For each configuration property, you need to write some Javadoc explaining its purpose.
ja_jp: それぞれの設定プロパティに対して、その目的を説明するJavadocを書く必要があります。

source: For each configured Redis client, two Redis data sources are exposed:
ja_jp: 設定された各 Redis クライアントに対して、2 つの Redis データソースが公開されます。

source: For each function, we compare:
ja_jp: 各関数について、比較します:

source: For each gRPC service you inject in your application, you can configure the following attributes:
ja_jp: アプリケーションにインジェクトする各gRPCサービスに対して、以下の属性を設定することができます。

source: For each kind of event, there is an associated _group_ providing the methods to handle that specific event: `onItem()`, `onFailure()`, `onCompletion()` and so on. These groups provide two methods to peek at the various events without impacting its distribution: `invoke` and `call`. It does not transform the received event; it notifies you that something happened and let you react.
ja_jp: イベントの種類ごとに、その特定のイベントを処理するための方法を提供する関連 _グループ_ があります: `onItem()`, `onFailure()`, `onCompletion()` など。これらのグループは、配信に影響を与えずに様々なイベントを覗くための 2 つの方法を提供しています: `invoke` と `call` 。これらのグループは、受信したイベントを変換するのではなく、何かが起こったことを通知して反応させてくれます。

source: For each logging API that is not JBoss Logging, add a logging adapter library to ensure that messages logged through these APIs are routed to the JBoss Log Manager backend. You can then verify whether the logs generated by the added library adhere to the same format as the other Quarkus logs.
ja_jp: JBoss Logging 以外のロギング API ごとにロギングアダプターライブラリーを追加して、それらの API を介して記録されたメッセージが JBoss Log Manager バックエンドにルーティングされるようにします。その後、追加されたライブラリーによって生成されたログが、他の Quarkus ログと同じフォーマットに従っているか確認できます。

source: For each logging API that is not `jboss-logging`:
ja_jp: `jboss-logging` 以外の各ロギングAPIについて：

source: For each named configuration, you can set a specific reload period:
ja_jp: 名前付き設定ごとに、特定のリロード期間を設定できます。

source: For each of those annotations, you may specify the name of the element they refer to, otherwise, they will use the name of the annotated method parameter.
ja_jp: これらのアノテーションはそれぞれ、参照する要素の名前を指定することができ、指定していない場合は、アノテーションされたメソッドのパラメーターの名前が使用されます。

source: For each of those annotations, you may specify the name of the element they refer to, otherwise they will use the name of the annotated method parameter.
ja_jp: これらのアノテーションごとに、参照する要素の名前を指定できます。指定しない場合は、アノテーションが付けられたメソッドパラメーターの名前が使用されます。

source: For each persistence unit, Hibernate Search will only consider indexed entities that are attached to that persistence unit. Entities are attached to a persistence unit by xref:hibernate-orm.adoc#multiple-persistence-units-attaching-model-classes[configuring the Hibernate ORM extension].
ja_jp: 各永続化ユニットについて、Hibernate Searchは、その永続化ユニットにアタッチされているインデックス付きエンティティのみを考慮します。エンティティは、 xref:hibernate-orm.adoc#multiple-persistence-units-attaching-model-classes[Hibernate ORMエクステンションを設定する]ことで、永続化ユニットにアタッチされます。

source: For each service expected to be exposed as a Kubernetes Service, configure the lookup:
ja_jp: Kubernetes Serviceとして公開される予定の各サービスについて、ルックアップを設定します。

source: For earlier versions of the CLI (pre-2.1.0.Final), you need to specify the `--registry-client` option, or the created project will use the `io.quarkus:quarkus-universe-bom` associated with the client's version.
ja_jp: CLIの以前のバージョン（2.1.0.Final以前）では、 `--registry-client` オプションを指定する必要があります。そうしないと、作成されたプロジェクトでは、クライアントのバージョンに関連付けられた `io.quarkus:quarkus-universe-bom` が使用されます。

source: For enhanced security, you can combine both methods: sign the claims first and then encrypt the resulting nested JWT. This process ensures both the confidentiality and integrity of the claims.
ja_jp: セキュリティーを強化するために、両方の方法を組み合わせることができます。 まずクレームに署名し、その後、作成された JWT をネスト化し、暗号化します。 このプロセスにより、クレームの機密性と整合性の両方が確保されます。

source: For entities attached to several persistence units, you cannot use Panache. You can mix the two approaches though and mix Panache entities and traditional entities where multiple persistence units are required.
ja_jp: 複数の永続化ユニットに接続されたエンティティではPanacheを使用することはできません。 しかし、この2つのアプローチを混在させることは可能で、Panacheエンティティと複数の永続化ユニットが必要な従来のエンティティを混在させることはできます。

source: For every Kafka _record_ from the `quote-requests` topic, Reactive Messaging calls the `process` method, and sends the returned `Quote` object to the `quotes` channel. In this case, we need to configure the channel in the `application.properties` file, to configures the `requests` and `quotes` channels:
ja_jp: `quote-requests` トピックからのすべての Kafka _record_ について、Reactive Messaging は `process` メソッドを呼び出し、返された `Quote` オブジェクトを `quotes` チャネルに送信します。この場合、 `application.properties` ファイルでチャネルを設定して、 `requests` および `quotes` チャネルを設定する必要があります。

source: For every Pulsar _message_ from the `quote-requests` topic, Reactive Messaging calls the `process` method, and sends the returned `Quote` object to the `quotes` channel. In this case, we need to configure the channel in the `application.properties` file, to configures the `requests` and `quotes` channels:
ja_jp: `quote-requests` トピックからのすべての Pulsar _message_ について、Reactive Messaging は `process` メソッドを呼び出し、返された `Quote` オブジェクトを `quotes` チャネルに送信します。この場合、 `application.properties` ファイルでチャネルを設定して、 `requests` および `quotes` チャネルを設定する必要があります。

source: For every `@RunOnVirtualThread` method that is not configured with a worker name, you can use the config property `smallrye.messaging.worker.<virtual-thread>.max-concurrency`.
ja_jp: ワーカー名が設定されていないすべての `@RunOnVirtualThread` メソッドに対して、設定プロパティー `smallrye.messaging.worker.<virtual-thread>.max-concurrency` を使用できます。

source: For every authenticated resource, you can inject a `SecurityIdentity` instance to get the authenticated identity information.
ja_jp: 認証済みリソースごとに、 `SecurityIdentity` インスタンスを注入して、認証済みの ID 情報を取得することができます。

source: For every tenant you need to create a named data source with the same identifier that is returned by the `TenantResolver`.
ja_jp: すべてのテナントに対して、 `TenantResolver` が返すのと同じ識別子を持つ名前付きデータソースを作成する必要があります。

source: For example
ja_jp: 以下に例を示します。

source: For example by default reflection in GraalVM will not work, unless a class/member has been explicitly registered for reflection. This is normally achieved by listing every class, method, field and constructor in a JSON file, and passing this as a parameter into the native image build. This obviously gets quite cumbersome for all but the most trivial projects. Quarkus provides a framework that makes it easy to work around these annotations, and programmatically determine what should be registered.
ja_jp: たとえば、デフォルトでは、クラス/メンバーがリフレクション用に明示的に登録されていない限り、GraalVMでのリフレクションは機能しません。これは通常、すべてのクラス、メソッド、フィールド、コンストラクターをJSONファイルにリストし、これをパラメーターとしてネイティブイメージビルドに渡すことで実現されます。これは、最も些細なプロジェクトを除いて、明らかに非常に面倒になります。 Quarkusは、これらのアノテーションを簡単に回避し、何を登録するかをプログラムで決定できるフレームワークを提供します。

source: For example the configuration of the previous code would be the following:
ja_jp: 例えば先のコードの設定は次のようになります:

source: For example the following bean provides an JSON schema and a Key/Value schema:
ja_jp: たとえば、次の Bean は JSON スキーマとキー/値スキーマを提供します。
